kriya-backend/app/controllers/images_controller.rb

SELECT "images".* FROM "images"
---
      def index
        images = Image.all

SELECT  "images".* FROM "images" WHERE "images"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
      def show
        image = Image.find_by(id: params[:id])