kriya-backend/app/controllers/videos_controller.rb

SELECT "videos".* FROM "videos"
---
      def index
          videos = Video.all

SELECT  "videos".* FROM "videos" WHERE "videos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
       def show
           video = Video.find(params[:id])